In [23]:
"""
Girilen yılın kaçıncı yüzyıl olduğunu bulan kod.
"""

while True:
    yil = int(input("Yıl giriniz:(Çıkış için 0 giriniz.) "))


    if yil==0:
        break
    elif 1200<=yil<1300:
        print("{} yılı 13. yüzyıldadır.".format(yil))
    elif 1300<=yil<1400:
        print ("{} yılı 14. yüzyıldadır.".format(yil))
    elif 1400<=yil<1500:
        print ("{} yılı 15. yüzyıldadır.".format(yil))
    elif 1500<=yil<1600:
        print ("{} yılı 16. yüzyıldadır.".format(yil))
    elif 1600<=yil<1700:
        print ("{} yılı 17. yüzyıldadır.".format(yil))
    elif 1700<=yil<1800:
        print ("{} yılı 18. yüzyıldadır.".format(yil))
    elif 1800<=yil<1900:
        print ("{} yılı 19. yüzyıldadır.".format(yil))
    elif 1900<=yil<2000:
        print ("{} yılı 20. yüzyıldadır.".format(yil))
    else:
        print("{} yılı 21. yüzyıldadır.".format(yil))

Yıl giriniz:(Çıkış için 0 giriniz.)  1999

1999 yılı 20. yüzyıldadır.

Yıl giriniz:(Çıkış için 0 giriniz.)  2060

2060 yılı 21. yüzyıldadır.

Yıl giriniz:(Çıkış için 0 giriniz.)  3000

3000 yılı 21. yüzyıldadır.

Yıl giriniz:(Çıkış için 0 giriniz.)  1564

1564 yılı 16. yüzyıldadır.

Yıl giriniz:(Çıkış için 0 giriniz.)  0

In [35]:
#Listenin içindeki en küçük elemanı bulma

liste = [2,4,5,3,4,5,1,6,7,4,3,0,-500,456]

mini = 100000000000
for each in liste:
    if (each<mini):
        mini=each
print(mini)

-500

In [53]:
def year2Century(year):
    """
    year to century
    """
    str_year = str(year)
    
    if(len(str_year)<3):
        return 1
    elif(len(str_year) == 3):
        if(str_year[1:3] == "00"):  # 100 ,200 300, 400 ... 900
            return int(str_year[0])
        else:                       # 190, 250, 450
            return int(str_year[0])+1
    else:                           # 1750, 1700, 1805
        if(str_year[2:4]=="00"):    # 1700, 1900, 1100
            return int(str_year[:2])
        else:                       # 1705, 1645, 1258
            return int(str_year[:2])+1
        
year2Century(input("Yıl giriniz: "))

Yıl giriniz:  1332

14

In [69]:
try:
    liste = [1,2,3,4]
    print(liste[int(input("index : "))])
    
except IndexError:
    print("Geçersiz index talebi...")

index :  6

Geçersiz index talebi...

In [70]:
s = "fffggg"

s[::-2]

'ggf'

In [71]:
a = 5.5

b = 3

print(a//b)

1.0

In [72]:
print(int(51.88+4/5))

52

In [78]:
a = {"x":2,"y":3}

b = dict(zip(a.values(),a.keys()))

print(b)

{2: 'x', 3: 'y'}

In [79]:
if "zaa" in {"caa":1,"zaa":2}:

    print("a")

    if "aa" in "zaa":

        print("b")

a
b

In [80]:
a = [1,2,3]

for i in a:

    i+1

print(a)

[1, 2, 3]

In [81]:
c = 1

while True:

    if c % 3 == 0:

        break

    print(c)

    c = c + 1

1
2

In [17]:
import pandas as pd
dataset = {"NAME" : ["recep", "ayca", "serdar"],
           "MAAS" : [6000, 6500, 5900]}

In [18]:
dataFrame1 = pd.DataFrame(dataset)
dataFrame1

     NAME  MAAS
0   recep  6000
1    ayca  6500
2  serdar  5900

In [25]:
ortalama_maas = dataFrame1.MAAS.mean()
print(ortalama_maas)

6133.333333333333

In [27]:
dataFrame1["Maas Durumu"] = ["Dusuk" if ortalama_maas>each else "Yuksek" for each in dataFrame1.MAAS]
dataFrame1

     NAME  MAAS Maas Durumu
0   recep  6000       Dusuk
1    ayca  6500      Yuksek
2  serdar  5900       Dusuk

In [28]:
dataFrame1.columns = [each.lower() for each in dataFrame1.columns]
dataFrame1

     name  maas maas durumu
0   recep  6000       Dusuk
1    ayca  6500      Yuksek
2  serdar  5900       Dusuk

In [29]:
#columns'da bosluklarin yerine _ koyalim.
dataFrame1.columns = [each.split()[0]+"_"+each.split()[1] if len(each.split())>1 else each for each in dataFrame1.columns]
dataFrame1

     name  maas maas_durumu
0   recep  6000       Dusuk
1    ayca  6500      Yuksek
2  serdar  5900       Dusuk